Revise architecture diagram in README.md
Updated architecture diagram format in README.
